; domain
(define (domain problem2)

    (:requirements :strips :typing)

    (:types
        location
        workstation
        robot
        carrier
        box
        content
        number
    )

    (:constants
        central_warehouse - location
        zero one two three four five six seven eight nine ten - number
    )

    (:predicates
        (adjacent ?l1 - location ?l2 - location)
        
        (walks ?r - robot)
        (flies ?r - robot)
        (jumps ?r - robot)

        (carrier_capacity ?c - carrier ?n - number)
        (increase_capacity ?n - number ?m - number)
        (decrease_capacity ?n - number ?m - number)

        (workstation_at_location ?w - workstation ?l - location)
        (robot_at_location ?r - robot ?l - location)
        (carrier_at_location ?c - carrier ?l - location)
        (box_at_location ?b - box ?l - location)
        (content_at_location_at_workstation ?c - content ?l - location ?w - workstation)
        (content_at_cw ?c - content)


        (robot_has_carrier ?r - robot ?c - carrier)
        (carrier_has_box ?c - carrier ?b - box)
        (box_has_content ?b - box ?c - content)

        (robot_is_attached ?r - robot)
        (carrier_is_attached ?c - carrier)
        (box_is_loaded ?b - box)
        (box_is_full ?b - box)
    )

    (:action move_walking
        :parameters(
            ?r - robot
            ?from - location
            ?to - location
        )
        :precondition(and
            (walks ?r)
            (robot_at_location ?r ?from)
            (adjacent ?from ?to)
        )
        :effect(and
            (not(robot_at_location ?r ?from))
            (robot_at_location ?r ?to)
        )
    )

    (:action move_flying
        :parameters(
            ?r - robot
            ?from - location
            ?to - location
        )
        :precondition(and
            (flies ?r)
            (robot_at_location ?r ?from)
        )
        :effect(and
            (not(robot_at_location ?r ?from))
            (robot_at_location ?r ?to)
        )
    )

    (:action move_jumping
        :parameters(
            ?r - robot
            ?from - location
            ?half - location
            ?to - location
        )
        :precondition(and
            (jumps ?r)
            (robot_at_location ?r ?from)
            (adjacent ?from ?half)
            (adjacent ?half ?to)
            (not (robot_at_location ?r ?to))
        )
        :effect(and
            (not(robot_at_location ?r ?from))
            (robot_at_location ?r ?to)
        )
    )

    (:action robot_attach_carrier
        :parameters (
            ?r - robot
            ?c - carrier
            ?l - location
        )
        :precondition(and
            (robot_at_location ?r ?l)
            (carrier_at_location ?c ?l)
            (not(robot_has_carrier ?r ?c))
            (not(robot_is_attached ?r))
            (not(carrier_is_attached ?c))
        )
        :effect(and
            (robot_has_carrier ?r ?c)
            (robot_is_attached ?r)
            (carrier_is_attached ?c)
            (not (carrier_at_location ?c ?l))
        )
    )

    (:action robot_detach_carrier
        :parameters (
            ?r - robot
            ?c - carrier
            ?l - location
        )
        :precondition(and
            (robot_at_location ?r ?l)
            (robot_has_carrier ?r ?c)
            (robot_is_attached ?r)
            (carrier_is_attached ?c)
        )
        :effect(and
            (not(robot_has_carrier ?r ?c))
            (not(robot_is_attached ?r))
            (not(carrier_is_attached ?c))
            (carrier_at_location ?c ?l)
        )
    )

    (:action robot_load_box
        :parameters (
            ?r - robot
            ?c - carrier
            ?b - box
            ?l - location
            ?n - number
            ?m - number
        )
        :precondition (and 
            (robot_at_location ?r ?l)
            (robot_has_carrier ?r ?c)
            (carrier_is_attached ?c)
            (box_at_location ?b ?l)
            (not (box_is_loaded ?b))
            (not (carrier_has_box ?c ?b))
            (carrier_capacity ?c ?n)
            (decrease_capacity ?n ?m)
        )
        :effect (and 
            (box_is_loaded ?b)
            (carrier_has_box ?c ?b)
            (not (box_at_location ?b ?l))
            (not (carrier_capacity ?c ?n))
            (carrier_capacity ?c ?m)
        )
    )

    (:action robot_unload_box
        :parameters (
            ?r - robot
            ?c - carrier
            ?b - box
            ?l - location
            ?n - number
            ?m - number
        )
        :precondition (and 
            (robot_at_location ?r ?l)
            (robot_has_carrier ?r ?c)
            (carrier_is_attached ?c)
            (box_is_loaded ?b)
            (carrier_has_box ?c ?b)
            (carrier_capacity ?c ?n)
            (increase_capacity ?n ?m)
        )
        :effect (and 
            (not (box_is_loaded ?b))
            (not (carrier_has_box ?c ?b))
            (box_at_location ?b ?l)
            (not (carrier_capacity ?c ?n))
            (carrier_capacity ?c ?m)
        )
    )

    (:action pick_up_content_at_cw
        :parameters (
            ?r - robot
            ?con - content
            ?car - carrier
            ?b - box
        )
        :precondition (and 
            (robot_at_location ?r central_warehouse)
            (content_at_cw ?con)
            (robot_has_carrier ?r ?car)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (not (box_is_full ?b))
        )
        :effect (and 
            (box_has_content ?b ?con)
            (box_is_full ?b)
        )
    )

    (:action put_down_content_at_cw
        :parameters (
            ?r - robot
            ?con - content
            ?car - carrier
            ?b - box
        )
        :precondition (and 
            (robot_at_location ?r central_warehouse)
            (content_at_cw ?con)
            (robot_has_carrier ?r ?car)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (box_has_content ?b ?con)
            (box_is_full ?b)
        )
        :effect (and 
            (not (box_has_content ?b ?con))
            (not (box_is_full ?b))
        )
    )

    (:action pick_up_content
        :parameters (
            ?r - robot
            ?car - carrier
            ?b - box
            ?con - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (workstation_at_location ?w ?l)
            (robot_has_carrier ?r ?car)
            (robot_is_attached ?r)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (not (box_is_full ?b))
            (content_at_location_at_workstation ?con ?l ?w)
        )
        :effect (and
            (box_has_content ?b ?con)
            (box_is_full ?b)
            (not (content_at_location_at_workstation ?con ?l ?w))
        )
    )

    (:action put_down_content
        :parameters (
            ?r - robot
            ?car - carrier
            ?b - box
            ?con - content
            ?l - location
            ?w - workstation
        )
        :precondition (and
            (robot_at_location ?r ?l)
            (workstation_at_location ?w ?l)
            (robot_has_carrier ?r ?car)
            (robot_is_attached ?r)
            (carrier_is_attached ?car)
            (carrier_has_box ?car ?b)
            (box_is_loaded ?b)
            (box_has_content ?b ?con)
            (box_is_full ?b)
        )
        :effect (and
            (not (box_has_content ?b ?con))
            (not (box_is_full ?b))
            (content_at_location_at_workstation ?con ?l ?w)
        )
    )
)

; problem
(define (problem problem_2)
    (:domain problem2)

    (:objects
        loc1 loc2 loc3 - location
        wor1_1 wor1_2 wor2_1 wor2_2 wor2_3 wor3_1 wor3_2 - workstation
        drone - robot
        carrier1 - carrier
        box1 box2 box3 box4 box5 box6 box7 box8 - box
        tool bolt valve parts gears - content
    )

    (:init
        (flies drone)

        (adjacent central_warehouse loc1)
        (adjacent loc1 central_warehouse)
        (adjacent loc1 loc2)
        (adjacent loc2 loc1)
        (adjacent loc2 loc3)
        (adjacent loc3 loc2)

        (workstation_at_location wor1_1 loc1)
        (workstation_at_location wor1_2 loc1)
        (workstation_at_location wor2_1 loc2)
        (workstation_at_location wor2_2 loc2)
        (workstation_at_location wor2_3 loc2)
        (workstation_at_location wor3_1 loc3)
        (workstation_at_location wor3_2 loc3)

        (robot_at_location drone central_warehouse)

        (carrier_capacity carrier1 six)
        (carrier_at_location carrier1 central_warehouse)

        (box_at_location box1 central_warehouse)
        (box_at_location box2 central_warehouse)
        (box_at_location box3 central_warehouse)
        (box_at_location box4 central_warehouse)
        (box_at_location box5 central_warehouse)
        (box_at_location box6 central_warehouse)
        (box_at_location box7 central_warehouse)
        (box_at_location box8 central_warehouse)

        (content_at_cw tool)
        (content_at_cw bolt)
        (content_at_cw valve)
        (content_at_cw parts)
        (content_at_cw gears)

        (increase_capacity zero one)
        (increase_capacity one two)
        (increase_capacity two three)
        (increase_capacity three four)
        (increase_capacity four five)
        (increase_capacity five six)
        (increase_capacity six seven)
        (increase_capacity seven eight)
        (increase_capacity eight nine)
        (increase_capacity nine ten)
        (decrease_capacity one zero)
        (decrease_capacity two one)
        (decrease_capacity three two)
        (decrease_capacity four three)
        (decrease_capacity five four)
        (decrease_capacity six five)
        (decrease_capacity seven six)
        (decrease_capacity eight seven)
        (decrease_capacity nine eight)
        (decrease_capacity ten nine)
    )
    
    (:goal
        (and
            (content_at_location_at_workstation valve loc1 wor1_1)
            (content_at_location_at_workstation tool loc2 wor2_1)
            (content_at_location_at_workstation bolt loc2 wor2_1)
            (content_at_location_at_workstation valve loc2 wor2_2)
            (content_at_location_at_workstation parts loc2 wor2_3)
            (content_at_location_at_workstation bolt loc3 wor3_1)
            (content_at_location_at_workstation parts loc3 wor3_1)
            (content_at_location_at_workstation gears loc3 wor3_2)
        )
    )
)

; plan
1. (robot_attach_carrier drone carrier1 central_warehouse)
   deleted: (carrier_at_location carrier1 central_warehouse)
   added: (robot_has_carrier drone carrier1) (robot_is_attached drone) (carrier_is_attached carrier1)
   goals met: 0 of 8
2. (robot_load_box drone carrier1 box1 central_warehouse six five)
   deleted: (box_at_location box1 central_warehouse) (carrier_capacity carrier1 six)
   added: (box_is_loaded box1) (carrier_has_box carrier1 box1) (carrier_capacity carrier1 five)
   goals met: 0 of 8
3. (robot_load_box drone carrier1 box2 central_warehouse five four)
   deleted: (box_at_location box2 central_warehouse) (carrier_capacity carrier1 five)
   added: (box_is_loaded box2) (carrier_has_box carrier1 box2) (carrier_capacity carrier1 four)
   goals met: 0 of 8
4. (pick_up_content_at_cw drone gears carrier1 box1)
   added: (box_has_content box1 gears) (box_is_full box1)
   goals met: 0 of 8
5. (pick_up_content_at_cw drone valve carrier1 box2)
   added: (box_has_content box2 valve) (box_is_full box2)
   goals met: 0 of 8
6. (move_flying drone central_warehouse loc1)
   deleted: (robot_at_location drone central_warehouse)
   added: (robot_at_location drone loc1)
   goals met: 0 of 8
7. (put_down_content drone carrier1 box2 valve loc1 wor1_1)
   deleted: (box_has_content box2 valve) (box_is_full box2)
   added: (content_at_location_at_workstation valve loc1 wor1_1)
   goals met: 1 of 8
8. (move_flying drone loc1 loc3)
   deleted: (robot_at_location drone loc1)
   added: (robot_at_location drone loc3)
   goals met: 1 of 8
9. (put_down_content drone carrier1 box1 gears loc3 wor3_2)
   deleted: (box_has_content box1 gears) (box_is_full box1)
   added: (content_at_location_at_workstation gears loc3 wor3_2)
   goals met: 2 of 8
10. (move_flying drone loc3 central_warehouse)
   deleted: (robot_at_location drone loc3)
   added: (robot_at_location drone central_warehouse)
   goals met: 2 of 8
11. (pick_up_content_at_cw drone valve carrier1 box1)
   added: (box_has_content box1 valve) (box_is_full box1)
   goals met: 2 of 8
12. (pick_up_content_at_cw drone tool carrier1 box2)
   added: (box_has_content box2 tool) (box_is_full box2)
   goals met: 2 of 8
13. (move_flying drone central_warehouse loc2)
   deleted: (robot_at_location drone central_warehouse)
   added: (robot_at_location drone loc2)
   goals met: 2 of 8
14. (put_down_content drone carrier1 box1 valve loc2 wor2_2)
   deleted: (box_has_content box1 valve) (box_is_full box1)
   added: (content_at_location_at_workstation valve loc2 wor2_2)
   goals met: 3 of 8
15. (put_down_content drone carrier1 box2 tool loc2 wor2_1)
   deleted: (box_has_content box2 tool) (box_is_full box2)
   added: (content_at_location_at_workstation tool loc2 wor2_1)
   goals met: 4 of 8
16. (move_flying drone loc2 central_warehouse)
   deleted: (robot_at_location drone loc2)
   added: (robot_at_location drone central_warehouse)
   goals met: 4 of 8
17. (pick_up_content_at_cw drone parts carrier1 box1)
   added: (box_has_content box1 parts) (box_is_full box1)
   goals met: 4 of 8
18. (pick_up_content_at_cw drone bolt carrier1 box2)
   added: (box_has_content box2 bolt) (box_is_full box2)
   goals met: 4 of 8
19. (move_flying drone central_warehouse loc2)
   deleted: (robot_at_location drone central_warehouse)
   added: (robot_at_location drone loc2)
   goals met: 4 of 8
20. (put_down_content drone carrier1 box1 parts loc2 wor2_3)
   deleted: (box_has_content box1 parts) (box_is_full box1)
   added: (content_at_location_at_workstation parts loc2 wor2_3)
   goals met: 5 of 8
21. (put_down_content drone carrier1 box2 bolt loc2 wor2_1)
   deleted: (box_has_content box2 bolt) (box_is_full box2)
   added: (content_at_location_at_workstation bolt loc2 wor2_1)
   goals met: 6 of 8
22. (move_flying drone loc2 central_warehouse)
   deleted: (robot_at_location drone loc2)
   added: (robot_at_location drone central_warehouse)
   goals met: 6 of 8
23. (pick_up_content_at_cw drone parts carrier1 box1)
   added: (box_has_content box1 parts) (box_is_full box1)
   goals met: 6 of 8
24. (pick_up_content_at_cw drone bolt carrier1 box2)
   added: (box_has_content box2 bolt) (box_is_full box2)
   goals met: 6 of 8
25. (move_flying drone central_warehouse loc3)
   deleted: (robot_at_location drone central_warehouse)
   added: (robot_at_location drone loc3)
   goals met: 6 of 8
26. (put_down_content drone carrier1 box1 parts loc3 wor3_1)
   deleted: (box_has_content box1 parts) (box_is_full box1)
   added: (content_at_location_at_workstation parts loc3 wor3_1)
   goals met: 7 of 8
27. (put_down_content drone carrier1 box2 bolt loc3 wor3_1)
   deleted: (box_has_content box2 bolt) (box_is_full box2)
   added: (content_at_location_at_workstation bolt loc3 wor3_1)
   goals met: 8 of 8
